---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegIsTooShortFailure
source: html/36a279c6-0a3b-77a3-162b-afe9e482e01b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegIsTooShortFailure Property

A winder leg is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderLegIsTooShortFailure { get; }
```